afrab/WSim/arch/msp430/msp430_uscia.c

/**
 *  \file   msp430_uscia.c
 *  \brief  MSP430 USCIA definition (based on "msp430_usart.c" UART MODE)
 *  \author Julien Carpentier
 *  \date   2011
 **/

#include <stdio.h> 
#include <string.h>
#include <ctype.h>

#include "arch/common/hardware.h"
#include "msp430.h"

/*****************************************************/
/*****************************************************/
/*****************************************************/

#define HW_SPY_MODE 1

#if HW_SPY_MODE != 0
#define HW_SPY(x...) HW_DMSG_MCUDEV(x)
#else
#define HW_SPY(x...) do { } while (0)
#endif

/* defined in msp430_debug.h */
// #if defined(DEBUG_USCIA)  
// char *str_ssel[] = { "external UCLK", "ACLK", "SMCLK", "SMCLK" };
// #endif

/*****************************************************/
/*****************************************************/
/*****************************************************/

// #define TRACER_UART_IDLE     0 
// 
// #define TRACER_UART_TX_RECV  1  /* data written to TXBUF      */
// #define TRACER_UART_TX_READY 2  /* data TX shifter ok         */
// #define TRACER_UART_RX_RECV  3  /* data written to Rx shifter */
// #define TRACER_UART_RX_READY 4  /* data written to Rx buff    */
// 

/*****************************************************/
/*****************************************************/
/*****************************************************/

//slau144e.pdf (page 461)
/**
In asynchronous mode, the USCI_Ax modules connect the MSP430 to an
external system via two external pins, UCAxRXD and UCAxTXD. UART mode
is selected when the UCSYNC bit is cleared.
UART mode features include:
- 7- or 8-bit data with odd, even, or non-parity
- Independent transmit and receive shift registers
- Separate transmit and receive buffer registers
- LSB-first or MSB-first data transmit and receive
- Built-in idle-line and address-bit communication protocols for multiprocessor systems   
- Receiver start-edge detection for auto-wake up from LPMx modes
- Programmable baud rate with modulation for fractional baud rate support
- Status flags for error detection and suppression
- Status flags for address detection
- Independent interrupt capability for receive and transmit
**/


/* ************************************************** */
/* ************************************************** */
/* ************************************************** */
#if defined(HW_SPY_MODE) 
#define HW_SPY_PRINT_CONFIG()					         \
  HW_SPY("msp430:uscia0: ============\n");                               \
  HW_SPY("msp430:uscia0:ctl0    %x\n",   MCU.uscia0.ucaxctl0.s);         \
  HW_SPY("msp430:uscia0:ctl1    %x\n",   MCU.uscia0.ucaxctl1.s);         \
  HW_SPY("msp430:uscia0:br0     %x\n",   MCU.uscia0.ucaxbr0);            \
  HW_SPY("msp430:uscia0:br1     %x\n",   MCU.uscia0.ucaxbr1);            \
  HW_SPY("msp430:uscia0:mctl    %x\n",   MCU.uscia0.ucaxmctl.s);         \
  HW_SPY("msp430:uscia0:stat    %x\n",   MCU.uscia0.ucaxstat.s);         \
  HW_SPY("msp430:uscia0:rxbuf   %x\n",   MCU.uscia0.ucaxrxbuf);          \
  HW_SPY("msp430:uscia0:txbuf   %x\n",   MCU.uscia0.ucaxtxbuf);          \
  HW_SPY("msp430:uscia0:abctl   %x\n",   MCU.uscia0.ucaxctl1.s);         \
  HW_SPY("msp430:uscia0:irtctl  %x\n",   MCU.uscia0.ucaxctl1.s);         \
  HW_SPY("msp430:uscia0:irrctl  %x\n",   MCU.uscia0.ucaxctl1.s);         \
  HW_SPY("msp430:uscia0: ============\n");                            
#else                                                                         
#define HW_SPY_PRINT_CONFIG() do {} while(0)
#endif

                       

#if defined(__msp430_have_uscia0)

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

static inline int32_t USCIA_MODE_UPDATE_BITCLK(int ucssel)
{
  int32_t res = 0;
  switch (ucssel)
    {
    case 0:
      ERROR("msp430:uscia0: USCIA clk = UCLK\n");
      res = 0;
      break;
    case 1:
      res = MCU_CLOCK.ACLK_increment;
      break;
    case 2:
    case 3:
      res = MCU_CLOCK.SMCLK_increment;
      break;
    }
  return res;
}

void msp430_uscia0_set_baudrate()                                  
{   
  MCU.uscia0.ucaxbr_div = ((MCU.uscia0.ucaxbr1 << 8 | MCU.uscia0.ucaxbr0) / 2) * (7+!(MCU.uscia0.ucaxctl0.b.uc7bit)); 
  HW_DMSG_USCIA("msp430:uscia0:   baudrate = div N %d/bit - %d/byte\n",      
		  ((MCU.uscia0.ucaxbr1 << 8 | MCU.uscia0.ucaxbr0) / 2),MCU.uscia0.ucaxbr_div);  
}

void msp430_uscia0_reset()
{
  MCU.uscia0.ucaxrxbuf             = 0;
  MCU.uscia0.ucaxrxbuf_full        = 0;
  MCU.uscia0.ucaxrx_shift_buf      = 0;
  MCU.uscia0.ucaxrx_shift_empty    = 1;
  MCU.uscia0.ucaxrx_shift_ready    = 0;                                           
  MCU.uscia0.ucaxrx_shift_delay    = 0;                                           
  MCU.uscia0.ucaxrx_slave_rx_done  = 0;  
                                                                               
  MCU.uscia0.ucaxtxbuf             = 0;                                           
  MCU.uscia0.ucaxtxbuf_full        = 0;                                           
  MCU.uscia0.ucaxtx_full_delay     = 0;                                                                           
  MCU.uscia0.ucaxtx_shift_buf      = 0;                                           
  MCU.uscia0.ucaxtx_shift_empty    = 1;                                           
  MCU.uscia0.ucaxtx_shift_ready    = 0;                                           
  MCU.uscia0.ucaxtx_shift_delay    = 0; 
}

/***************************/
/********* MCU API *********/

/* update uscia0 within internal device loop */
void msp430_uscia0_update()
{
   do {                                                                          
                                                                              
    /* TX buffer */                                                                               
     if (MCU.uscia0.ucaxtxbuf_full == 1)                                        
	  {                                                                     
	    if ((MCU.uscia0.ucaxtx_full_delay <= 0) && (MCU.uscia0.ucaxtx_shift_empty == 1)) 
	      {                                                                 
		MCU.uscia0.ucaxtx_shift_buf   = MCU.uscia0.ucaxtxbuf;                
		MCU.uscia0.ucaxtxbuf_full     = 0;                                
		MCU.uscia0.ucaxtx_full_delay  = 0;                                
		MCU.uscia0.ucaxtx_shift_empty = 0;                                
		MCU.uscia0.ucaxtx_shift_ready = 0;                                
		MCU.uscia0.ucaxtx_shift_delay = MCU.uscia0.ucaxbr_div;               
		MCU.sfr.ifg2.b.uca0txifg = 1;                                
		if (MCU.sfr.ie2.b.uca0txie)                                   
		  {                                                            
		      msp430_interrupt_set(INTR_USCIX0_TX);               
		  }                                                            
		else      
		  {      
		    DMA_SET_UTXIFG0();
		  }		      
		HW_DMSG_USCIA("msp430:uscia0: USCIA tx buf -> shifter (delay %d, val %d)\n", 
			      MCU.uscia0.ucaxtx_shift_delay, MCU.uscia0.ucaxtxbuf);            
		HW_SPY("msp430:uscia0: USCIA send (0x%x,%c)\n",            
		    MCU.uscia0.ucaxtxbuf, isgraph(MCU.uscia0.ucaxtxbuf) ?             
		    MCU.uscia0.ucaxtxbuf : '.');                                   
	      }                                                                 
	    else                                                                
	      {                                                                 
		/* dec ucaxtx_full_delay */                                       
		MCU.uscia0.ucaxtx_full_delay -=                                    
			USCIA_MODE_UPDATE_BITCLK(MCU.uscia0.ucaxctl1.b.ucssel);
	      }                                                                 
	} /* ucaxtfubuf_full */                                                                                                     


    /* TX shift register */                                                                      
    if (MCU.uscia0.ucaxtx_shift_empty == 0)                                        
      {                                                                         
	MCU.uscia0.ucaxtx_shift_delay -=                                           
	      USCIA_MODE_UPDATE_BITCLK(MCU.uscia0.ucaxctl1.b.ucssel);            
	if (MCU.uscia0.ucaxtx_shift_delay <= 0)                                    
	  {                                                                     
	    /*tracer_event_record(TRACER_USCIA0,TRACER_USCIA_TX_READY);*/    
	    MCU.uscia0.ucaxtx_shift_ready = 1;                                     
	  }	      
      } /* tx_shift_empty */	      


