afrab/WSim/arch/msp430/msp430_uscia.c
    /* RX shift register */                                                 
     if (MCU.uscia0.ucaxrx_shift_empty == 0)                                    
	{                                                                     
	    if (MCU.uscia0.ucaxstat.b.uclisten == 1)                                  
	      {                                                                 
		  ERROR("msp430:uscia0: USCIA listen mode not supported\n"); 
	      }                                                                              
	    MCU.uscia0.ucaxrx_shift_delay -=      
	      USCIA_MODE_UPDATE_BITCLK(MCU.uscia0.ucaxctl1.b.ucssel);	       
										
	    if (MCU.uscia0.ucaxrx_shift_delay <= 0)                                 
	      {                                                                  
		  MCU.uscia0.ucaxrx_shift_ready = 1;                                 
	      }                                                                  
	} /* shift empty */                                                    


      if (MCU.uscia0.ucaxrx_shift_ready == 1)                                     
	{                                                                      
	    if (MCU.uscia0.ucaxrxbuf_full == 1)                                     
	      {                                                                  
		  MCU.uscia0.ucaxstat.b.ucoe = 1;                                      
		  ERROR("msp430:uscia0: USCIA Rx Overrun (0x%x,%c)\n",       
		      MCU.uscia0.ucaxrx_shift_buf,                                 
		      isgraph(MCU.uscia0.ucaxrx_shift_buf) ?                       
		      MCU.uscia0.ucaxrx_shift_buf : '.');                          
	      }                                                                  
	    /*tracer_event_record(TRACER_USCIA0,TRACER_USCIA_RX_READY);*/     
	    MCU.uscia0.ucaxrxbuf          = MCU.uscia0.ucaxrx_shift_buf;               
	    MCU.uscia0.ucaxrxbuf_full     = 1;                                      
	    MCU.uscia0.ucaxrx_shift_ready = 0;                                      
	    MCU.uscia0.ucaxrx_shift_empty = 1;                                      
	    HW_DMSG_USCIA("msp430:uscia0: USCIA rx shifter -> rx buf\n");    
	    HW_SPY("msp430:uscia0: USCIA receive (0x%x,%c)\n",               
		    MCU.uscia0.ucaxrxbuf, isgraph(MCU.uscia0.ucaxrxbuf) ?              
		    MCU.uscia0.ucaxrxbuf : '.');                                    
	    MCU.sfr.ifg2.b.uca0rxifg  = 1; 
	    
	    if (MCU.sfr.ie2.b.uca0rxie)                                         
	      {                                                                  
		msp430_interrupt_set(INTR_USCIX0_RX);                     
	      }                                                                  
	    else       
	      {      
		DMA_SET_URXIFG0();
	      }      
	 } /* shift ready */  
	  
    } while (0);
}

/* uscia0 read from MCU */
int8_t msp430_uscia0_read(uint16_t addr)
{
  int8_t res;                                                                 
  switch (addr)                                                               
    {                                                                         
    case UCA0CTL0        :                                                 
      res = MCU.uscia0.ucaxctl0.s;                                                
      HW_DMSG_USCIA("msp430:uscia0: read ucaxctl0 = 0x%02x\n", res & 0xff);  
      break;      
    case UCA0CTL1        :                                                 
      res = MCU.uscia0.ucaxctl1.s;                                                
      HW_DMSG_USCIA("msp430:uscia0: read ucaxctl1 = 0x%02x\n", res & 0xff);  
      break;
    case UCA0BR0        :                                                 
      res = MCU.uscia0.ucaxbr0;                                                  
      HW_DMSG_USCIA("msp430:uscia0: read ucaxbr0 = 0x%02x\n", res & 0xff);  
      break;                                                                 
    case UCA0BR1        :                                                 
      res = MCU.uscia0.ucaxbr1;                                                 
      HW_DMSG_USCIA("msp430:uscia0: read ucaxbr1 = 0x%02x\n", res & 0xff);  
      break;    
    case UCA0MCTL       :                                                 
      res = MCU.uscia0.ucaxmctl.s;                                                 
      HW_DMSG_USCIA("msp430:uscia0: read ucaxmctl = 0x%02x\n", res & 0xff); 
      break;  
    case UCA0STAT       :                                               
      res = MCU.uscia0.ucaxstat.s;                                                 
      HW_DMSG_USCIA("msp430:uscia0: read ucaxstat = 0x%02x\n", res & 0xff); 
      break;  
    case UCA0RXBUF      :                                                 
      res = MCU.uscia0.ucaxrxbuf;                                                
      MCU.sfr.ifg2.b.uca0rxifg   = 0;                                          
      MCU.uscia0.ucaxrxbuf_full  = 0;                                          
      /*TRACER_TRACE_USCIA(TRACER_USCIA_IDLE);*/                                                                                                 \
      MCU.uscia0.ucaxstat.b.ucoe = 0;                                          
      HW_DMSG_USCIA("msp430:uscia0: read ucaxrxbuf = 0x%02x\n", res & 0xff);
      break;                                                                  
    case UCA0TXBUF      :                                                 
      res = MCU.uscia0.ucaxtxbuf;                                                
      MCU.sfr.ifg2.b.uca0txifg = 0;                                          
      HW_DMSG_USCIA("msp430:uscia0: read ucaxtxbuf = 0x%02x\n", res & 0xff);
      break;                                
    case UCA0ABCTL      :                                                 
      res = MCU.uscia0.ucaxabctl.s;                                               
      HW_DMSG_USCIA("msp430:uscia0: read ucaxabctl = 0x%02x [PC=0x%04x]\n", res & 0xff, mcu_get_pc()); 
      break;  
    case UCA0IRTCTL     :                                                 
      res = MCU.uscia0.ucaxirtctl.s;                                               
      HW_DMSG_USCIA("msp430:uscia0: read ucaxirtctl = 0x%02x [PC=0x%04x]\n", res & 0xff, mcu_get_pc()); 
      break;                                                                  
    case UCA0IRRCTL     :                                                 
      res = MCU.uscia0.ucaxirrctl.s;                                              
      HW_DMSG_USCIA("msp430:uscia0: read ucaxirrctl = 0x%02x\n", res & 0xff); 
      break;                                                                                                                                                                                                  
    default                 :                                                 
      res = 0;                                                                
      ERROR("msp430:uscia0: read bad address 0x%04x\n", addr);            
      break;                                                                  
    }                                                                         
  return res;                                    
}

/* uscia0 write from MCU */
void msp430_uscia0_write(uint16_t UNUSED addr, int8_t UNUSED val)
{
  switch (addr)                                                               
    {                                                                         
    case UCA0CTL0        :		/* ctrl register 0 */                                            
      { 
	/*temporary value*/
	union {                                                               
	  struct ucaxctl0_t   b; 
	  uint8_t             s;                                              
	} ctl0;                                                                                                                             
	ctl0.s = val;                                               
	/*debug message*/
	HW_DMSG_USCIA("msp430:uscia0: write ucaxctl0 = 0x%02x\n", val & 0xff);                    
	HW_DMSG_USCIA("msp430:uscia0: ucpen = %d\n", 	ctl0.b.ucpen);
	HW_DMSG_USCIA("msp430:uscia0: ucpar = %d\n", 	ctl0.b.ucpar);
	HW_DMSG_USCIA("msp430:uscia0: ucmsb = %d\n", 	ctl0.b.ucmsb);
	HW_DMSG_USCIA("msp430:uscia0: uc7bit = %d\n", 	ctl0.b.uc7bit);
	HW_DMSG_USCIA("msp430:uscia0: ucspb = %d\n", 	ctl0.b.ucspb);
	HW_DMSG_USCIA("msp430:uscia0: ucmode = %d\n", 	ctl0.b.ucmode);
	HW_DMSG_USCIA("msp430:uscia0: ucsync = %d\n", 	ctl0.b.ucsync);                                                                     
	HW_DMSG_USCIA("msp430:uscia0: length = %d bits\n",             
                                           (ctl0.b.uc7bit == 1) ? 7:8);         
        /*modifications*/                                                                          
        MCU.uscia0.ucaxctl0.s = val;
	if (ctl0.b.uc7bit != MCU.uscia0.ucaxctl0.b.uc7bit) 
	{                         
           msp430_uscia0_set_baudrate();                         
        } 
      }                                                                       
      break;
      
