afrab/WSim/arch/msp430/msp430_uscia.c
    case UCA0CTL1       :		/* ctrl register 1 */                                            
      { 
	/*temporary value*/
	union {                                                               
	  struct ucaxctl1_t   b; 
	  uint8_t             s;                                              
	} ctl1;                                                                                                                             
	ctl1.s = val;                                               
	/*debug message*/
	HW_DMSG_USCIA("msp430:uscia0: write ucaxctl1 = 0x%02x\n", val & 0xff);                    
	HW_DMSG_USCIA("msp430:uscia0: ucssel  = %d\n", 	ctl1.b.ucssel);
	HW_DMSG_USCIA("msp430:uscia0: ucrxeie  = %d\n", ctl1.b.ucrxeie);
	HW_DMSG_USCIA("msp430:uscia0: ucbrkie = %d\n", 	ctl1.b.ucbrkie);
	HW_DMSG_USCIA("msp430:uscia0: ucdorm = %d\n", 	ctl1.b.ucdorm);
	HW_DMSG_USCIA("msp430:uscia0: uctxaddr = %d\n", ctl1.b.uctxaddr);
	HW_DMSG_USCIA("msp430:uscia0: uctxbrk = %d\n", 	ctl1.b.uctxbrk);
	HW_DMSG_USCIA("msp430:uscia0: ucswrst = %d\n", 	ctl1.b.ucswrst);

        /*modifications*/                                                                          
	if ((ctl1.b.ucswrst == 0) && (MCU.uscia0.ucaxctl1.b.ucswrst == 0))       
          {                                                                   
             /* reset  UCA0RXIE, UCA0TXIE, UCA0RXIFG, UCOE, and UCFE bits */            
             /* set    UCA0TXIFG flag                                     */           
             HW_DMSG_USCIA("msp430:uscia0:   swrst  = 1, reset flags\n");                                             
             MCU.sfr.ie2.b.uca0rxie           = 0;                                 
             MCU.sfr.ie2.b.uca0txie           = 0;                                 
             MCU.sfr.ifg2.b.uca0rxifg         = 0; 
	     MCU.sfr.ifg2.b.uca0txifg         = 1; 
             MCU.uscia0.ucaxstat.b.ucoe       = 0;                                 
             MCU.uscia0.ucaxstat.b.ucfe      = 0;                                                                     
             /* finishing current transaction */                              
             MCU.uscia0.ucaxtxbuf_full        = 0;                                 
             MCU.uscia0.ucaxtx_full_delay     = 0;             
             MCU.uscia0.ucaxtx_shift_empty    = 1;                                 
             MCU.uscia0.ucaxrxbuf_full        = 0;                                 
             MCU.uscia0.ucaxrx_shift_empty    = 1;                                 
          }
          
          MCU.uscia0.ucaxctl1.s = val;  
          if (ctl1.b.ucssel != MCU.uscia0.ucaxctl1.b.ucssel)                           
          {                                                                   
             msp430_uscia0_set_baudrate();                       
          }             
      }                                                                       
      break;
      
     case UCA0BR0       : 		/* baud rate ctrl register 0 */                 
      HW_DMSG_USCIA("msp430:uscia0: write ucaxbr0  = 0x%02x\n",val & 0xff);
      MCU.uscia0.ucaxbr0 = val;                                                  
      msp430_uscia0_set_baudrate();                              
      break;     
      
     case UCA0BR1        : 		/* baud rate ctrl register 1 */                 
      HW_DMSG_USCIA("msp430:uscia0: write ucaxbr1  = 0x%02x\n",val & 0xff);
      MCU.uscia0.ucaxbr1 = val;                                                  
      msp430_uscia0_set_baudrate();                              
      break;
      
     case UCA0MCTL       :		/* Modulation ctrl register */                                            
	{ 
	  /*temporary value*/
	  union {                                                               
	    struct ucaxmctl_t   b; 
	    uint8_t             s;                                              
	  } mctl;                                                                                                                             
	  mctl.s = val;                                               
	  /*debug message*/
	  HW_DMSG_USCIA("msp430:uscia0: write ucaxctl1 = 0x%02x\n", val & 0xff);                    
	  HW_DMSG_USCIA("msp430:uscia0: ucbrf  = %d\n", 	mctl.b.ucbrf);
	  HW_DMSG_USCIA("msp430:uscia0: ucbrs  = %d\n", 	mctl.b.ucbrs);
	  HW_DMSG_USCIA("msp430:uscia0: ucos16 = %d\n", 	mctl.b.ucos16);
	  
	  /*modifications*/                                                                          
	  MCU.uscia0.ucaxmctl.s = val;  
	  msp430_uscia0_set_baudrate(); 
	}                                                                       
	break;
      
      case UCA0STAT       :		/* Status ctrl register */ 
	{
	  /*temporary value*/
	  union {                                                               
	    struct ucaxstat_t   b;
	    uint8_t             s;                                              
	  } stat;                                                                                                                                      
	  stat.s = val;          
	  /*debug message*/
	  HW_DMSG_USCIA("msp430:uscia0: write ucbxstat = 0x%02x\n", val & 0xff);                   
	  HW_DMSG_USCIA("msp430:uscia0: uclisten = %d\n",stat.b.uclisten);
	  HW_DMSG_USCIA("msp430:uscia0: ucfe = %d\n",	 stat.b.ucfe);
	  HW_DMSG_USCIA("msp430:uscia0: ucoe = %d\n", 	 stat.b.ucoe);
	  HW_DMSG_USCIA("msp430:uscia0: ucpe = %d\n", 	 stat.b.ucpe);
	  HW_DMSG_USCIA("msp430:uscia0: ucbrk = %d\n", 	 stat.b.ucbrk);
	  HW_DMSG_USCIA("msp430:uscia0: ucrxerr = %d\n", stat.b.ucrxerr);
	  HW_DMSG_USCIA("msp430:uscia0: ucaddr = %d\n",  stat.b.ucaddr);
	  HW_DMSG_USCIA("msp430:uscia0: ucbusy = %d\n",	 stat.b.ucbusy);
	  
	  /*modifications*/
	  MCU.uscia0.ucaxstat.s = val;
	}
	break;
	
      case UCA0RXBUF      :                                                 
	ERROR("msp430:uscia0: writing to read only register RXBUFF\n");    
	break;  
	
      case UCA0TXBUF      :    
	{
	  HW_DMSG_USCIA("msp430:uscia0: write ucaxtxbuf  = 0x%02x [PC=0x%04x]\n",val &0xff, mcu_get_pc());
	  if (MCU.uscia0.ucaxtxbuf_full == 1)
	  {                                                                     
	    WARNING("msp430:uscia0:    overwriting tx buffer with [0x%02x]\n",val & 0xff);                                              
	  }                                                                     
	  MCU.uscia0.ucaxtxbuf            = val;                                     
	  MCU.uscia0.ucaxtxbuf_full       = 1;                                       
	  MCU.uscia0.ucaxtx_full_delay    = 1; /* go to shifter after xx BITCLK */                                      
	  MCU.sfr.ifg2.b.uca0txifg        = 0;                                                                             \
	  /*TRACER_TRACE_USCIA(TRACER_USCIA_TX_RECV);*/			     
	  /* can be a dupe from the platform file */                            
	  /*etracer_slot_event(ETRACER_PER_ID_MCU_USCIA,                    
			    ETRACER_PER_EVT_WRITE_COMMAND,                     
			    ETRACER_PER_ARG_WR_DST_FIFO, 0);*/                                                                                                                                                                                                     
	}
	break; 
      
      case UCA0IRTCTL       :		/* IrDA Transmit ctrl register */ 
	{
	  /*temporary value*/
	  union {                                                               
	    struct ucaxirtctl_t   b;
	    uint8_t               s;                                              
	  } irtctl;                                                                                                                                      
	  irtctl.s = val;          
	  /*debug message*/
	  HW_DMSG_USCIA("msp430:uscia0: write ucbxabctl = 0x%02x\n", val & 0xff);                   
	  HW_DMSG_USCIA("msp430:uscia0: ucirtxpl  = %d\n",  irtctl.b.ucirtxpl);
	  HW_DMSG_USCIA("msp430:uscia0: ucirtxclk = %d\n",  irtctl.b.ucirtxclk);
	  HW_DMSG_USCIA("msp430:uscia0: uciren    = %d\n",  irtctl.b.uciren);
	  
	  /*modifications*/
	  MCU.uscia0.ucaxirtctl.s = val;
	}
	break;
	
      case UCA0IRRCTL       :		/* IrDA Receive ctrl register */ 
	{
	  /*temporary value*/
	  union {                                                               
	    struct ucaxirrctl_t   b;
	    uint8_t              s;                                              
	  } irrctl;                                                                                                                                      
	  irrctl.s = val;          
	  /*debug message*/
	  HW_DMSG_USCIA("msp430:uscia0: write ucbxabctl = 0x%02x\n", val & 0xff);                   
	  HW_DMSG_USCIA("msp430:uscia0: ucirrxfl  = %d\n",  irrctl.b.ucirrxfl);
	  HW_DMSG_USCIA("msp430:uscia0: ucirrxpl   = %d\n", irrctl.b.ucirrxpl);
	  HW_DMSG_USCIA("msp430:uscia0: ucirrxfe   = %d\n", irrctl.b.ucirrxfe);
	  /*modifications*/
	  MCU.uscia0.ucaxirrctl.s = val;
	}
	break;
	
      case UCA0ABCTL        :		/* Auto Baud Rate ctrl register */ 
	{
	/*temporary value*/
	  union {                                                               
	    struct ucaxabctl_t   b;
	    uint8_t              s;                                              
	  } abctl;                                                                                                                                      
	  abctl.s = val;          
	  /*debug message*/
	  HW_DMSG_USCIA("msp430:uscia0: write ucbxabctl = 0x%02x\n", val & 0xff);                   
	  HW_DMSG_USCIA("msp430:uscia0: reserved0 = %d\n",  abctl.b.reserved0);
	  HW_DMSG_USCIA("msp430:uscia0: ucdelim  = %d\n",   abctl.b.ucdelim);
	  HW_DMSG_USCIA("msp430:uscia0: ucstoe   = %d\n",   abctl.b.ucstoe);
	  HW_DMSG_USCIA("msp430:uscia0: ucbtoe   = %d\n",   abctl.b.ucbtoe);
	  HW_DMSG_USCIA("msp430:uscia0: reserved1 = %d\n",  abctl.b.reserved1);
	  HW_DMSG_USCIA("msp430:uscia0: ucabden  = %d\n",   abctl.b.ucabden);
    
	  /*modifications*/
	  MCU.uscia0.ucaxabctl.s = val;
	}
	break;
	
